{"format": "graph-model", "generatedBy": "2.9.1", "convertedBy": "TensorFlow.js Converter v3.19.0", "signature": {"inputs": {"text_vectorization_5_input": {"name": "text_vectorization_5_input:0", "dtype": "DT_STRING", "tensorShape": {"dim": [{"size": "-1"}]}}}, "outputs": {"dense_25": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "5"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/CNN_hotel_review/lstm_28/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/CNN_hotel_review/lstm_28/strided_slice_3/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/CNN_hotel_review/lstm_28/strided_slice_3/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/CNN_hotel_review/lstm_28/strided_slice_3/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/CNN_hotel_review/dense_25/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}, {"size": "5"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/CNN_hotel_review/dense_25/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}]}}}}}, {"name": "StatefulPartitionedCall/CNN_hotel_review/lstm_28/while/maximum_iterations", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/CNN_hotel_review/lstm_28/while/loop_counter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/CNN_hotel_review/lstm_28/time", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "Func/StatefulPartitionedCall/input/_9", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_10", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_11", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/CNN_hotel_review/lstm_28/strided_slice_1/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/CNN_hotel_review/lstm_28/strided_slice_1/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/CNN_hotel_review/lstm_28/strided_slice_1/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/CNN_hotel_review/lstm_28/zeros_1/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/CNN_hotel_review/lstm_28/zeros_1/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/CNN_hotel_review/lstm_27/transpose_1/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/CNN_hotel_review/lstm_28/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/CNN_hotel_review/lstm_28/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/CNN_hotel_review/lstm_28/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/CNN_hotel_review/lstm_28/zeros/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/CNN_hotel_review/lstm_28/zeros/Const", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/CNN_hotel_review/lstm_27/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/CNN_hotel_review/lstm_28/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/CNN_hotel_review/lstm_28/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/CNN_hotel_review/lstm_28/TensorArrayV2_1/num_elements", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/CNN_hotel_review/lstm_27/while/loop_counter", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/CNN_hotel_review/lstm_27/while/maximum_iterations", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/CNN_hotel_review/lstm_27/time", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "Func/StatefulPartitionedCall/input/_6", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_7", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}}, {"name": "Func/StatefulPartitionedCall/input/_8", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/CNN_hotel_review/lstm_27/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/CNN_hotel_review/lstm_27/strided_slice_1/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/CNN_hotel_review/lstm_27/strided_slice_1/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/CNN_hotel_review/lstm_27/strided_slice_1/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/CNN_hotel_review/lstm_27/zeros_1/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/CNN_hotel_review/lstm_27/zeros_1/Const", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/CNN_hotel_review/lstm_27/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/CNN_hotel_review/lstm_27/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/CNN_hotel_review/lstm_27/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/CNN_hotel_review/lstm_27/zeros/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/CNN_hotel_review/lstm_27/zeros/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_3", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "15000"}, {"size": "32"}]}}}}}, {"name": "StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/RaggedToTensor/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "unknown_1", "op": "Const", "attr": {"dtype": {"type": "DT_STRING"}, "value": {"tensor": {"dtype": "DT_STRING", "tensorShape": {}}}}}, {"name": "unknown_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "unknown_0", "op": "Const", "attr": {"dtype": {"type": "DT_INT64"}, "value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/RaggedToTensor/default_value", "op": "Const", "attr": {"dtype": {"type": "DT_INT64"}, "value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StringSplit/strided_slice_1/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StringSplit/strided_slice_1/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StringSplit/strided_slice_1/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StringSplit/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_STRING", "tensorShape": {}}}, "dtype": {"type": "DT_STRING"}}}, {"name": "StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StringSplit/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StringSplit/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StringSplit/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/CNN_hotel_review/embedding_layer/embedding_lookup/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/CNN_hotel_review/max_pooling1d_19/ExpandDims/dim", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/CNN_hotel_review/lstm_27/transpose/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/CNN_hotel_review/lstm_27/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "text_vectorization_5_input", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}]}}, "dtype": {"type": "DT_STRING"}}}, {"name": "unknown", "op": "Placeholder", "attr": {"shape": {"shape": {}}, "dtype": {"type": "DT_RESOURCE"}}}, {"name": "StatefulPartitionedCall/CNN_hotel_review/lstm_28/TensorArrayV2_1", "op": "TensorListReserve", "input": ["StatefulPartitionedCall/CNN_hotel_review/lstm_28/TensorArrayV2_1/element_shape", "StatefulPartitionedCall/CNN_hotel_review/lstm_28/TensorArrayV2_1/num_elements"], "attr": {"shape_type": {"type": "DT_INT32"}, "element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StringLower", "op": "StringLower", "input": ["text_vectorization_5_input"], "attr": {"encoding": {"s": ""}}}, {"name": "StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace", "op": "StaticRegexReplace", "input": ["StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StringLower"], "attr": {"rewrite": {"s": "d2lsbCBub3Q="}, "replace_global": {"b": true}, "pattern": {"s": "d29uJ3Q="}}}, {"name": "StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_1", "op": "StaticRegexReplace", "input": ["StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace"], "attr": {"pattern": {"s": "Y2FuJ3Q="}, "replace_global": {"b": true}, "rewrite": {"s": "Y2FuIG5vdA=="}}}, {"name": "StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_2", "op": "StaticRegexReplace", "input": ["StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_1"], "attr": {"rewrite": {"s": "IG5vdA=="}, "replace_global": {"b": true}, "pattern": {"s": "bid0"}}}, {"name": "StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_3", "op": "StaticRegexReplace", "input": ["StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_2"], "attr": {"pattern": {"s": "J3Jl"}, "replace_global": {"b": true}, "rewrite": {"s": "IGFyZQ=="}}}, {"name": "StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_4", "op": "StaticRegexReplace", "input": ["StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_3"], "attr": {"replace_global": {"b": true}, "pattern": {"s": "J3M="}, "rewrite": {"s": "IGlz"}}}, {"name": "StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_5", "op": "StaticRegexReplace", "input": ["StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_4"], "attr": {"replace_global": {"b": true}, "rewrite": {"s": "IHdvdWxk"}, "pattern": {"s": "J2Q="}}}, {"name": "StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_6", "op": "StaticRegexReplace", "input": ["StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_5"], "attr": {"rewrite": {"s": "IHdpbGw="}, "pattern": {"s": "J2xs"}, "replace_global": {"b": true}}}, {"name": "StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_7", "op": "StaticRegexReplace", "input": ["StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_6"], "attr": {"replace_global": {"b": true}, "pattern": {"s": "J3Q="}, "rewrite": {"s": "IG5vdA=="}}}, {"name": "StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_8", "op": "StaticRegexReplace", "input": ["StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_7"], "attr": {"replace_global": {"b": true}, "rewrite": {"s": "IGhhdmU="}, "pattern": {"s": "J3Zl"}}}, {"name": "StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_9", "op": "StaticRegexReplace", "input": ["StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_8"], "attr": {"replace_global": {"b": true}, "rewrite": {"s": "IGFt"}, "pattern": {"s": "J20="}}}, {"name": "StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_10", "op": "StaticRegexReplace", "input": ["StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_9"], "attr": {"rewrite": {"s": "IA=="}, "replace_global": {"b": true}, "pattern": {"s": "XGQrKD86XC5cZCopPyg/OltlRV1bKy1dP1xkKyk/"}}}, {"name": "StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_11", "op": "StaticRegexReplace", "input": ["StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_10"], "attr": {"pattern": {"s": "W15BLVphLXowLTldKw=="}, "rewrite": {"s": "IA=="}, "replace_global": {"b": true}}}, {"name": "StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_12", "op": "StaticRegexReplace", "input": ["StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_11"], "attr": {"replace_global": {"b": true}, "rewrite": {"s": "IA=="}, "pattern": {"s": "W15BLVphLXowLTlfXStkb25bXkEtWmEtejAtOV9dKw=="}}}, {"name": "StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_13", "op": "StaticRegexReplace", "input": ["StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_12"], "attr": {"pattern": {"s": "W15BLVphLXowLTlfXStib3RoW15BLVphLXowLTlfXSs="}, "replace_global": {"b": true}, "rewrite": {"s": "IA=="}}}, {"name": "StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_14", "op": "StaticRegexReplace", "input": ["StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_13"], "attr": {"rewrite": {"s": "IA=="}, "pattern": {"s": "W15BLVphLXowLTlfXSt3ZVteQS1aYS16MC05X10r"}, "replace_global": {"b": true}}}, {"name": "StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_15", "op": "StaticRegexReplace", "input": ["StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_14"], "attr": {"rewrite": {"s": "IA=="}, "pattern": {"s": "W15BLVphLXowLTlfXStmYXJbXkEtWmEtejAtOV9dKw=="}, "replace_global": {"b": true}}}, {"name": "StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_16", "op": "StaticRegexReplace", "input": ["StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_15"], "attr": {"rewrite": {"s": "IA=="}, "pattern": {"s": "W15BLVphLXowLTlfXStzaG91bGQndmVbXkEtWmEtejAtOV9dKw=="}, "replace_global": {"b": true}}}, {"name": "StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_17", "op": "StaticRegexReplace", "input": ["StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_16"], "attr": {"replace_global": {"b": true}, "rewrite": {"s": "IA=="}, "pattern": {"s": "W15BLVphLXowLTlfXStvdXRzaWRlW15BLVphLXowLTlfXSs="}}}, {"name": "StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_18", "op": "StaticRegexReplace", "input": ["StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_17"], "attr": {"rewrite": {"s": "IA=="}, "replace_global": {"b": true}, "pattern": {"s": "W15BLVphLXowLTlfXStuZWFyW15BLVphLXowLTlfXSs="}}}, {"name": "StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_19", "op": "StaticRegexReplace", "input": ["StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_18"], "attr": {"rewrite": {"s": "IA=="}, "pattern": {"s": "W15BLVphLXowLTlfXSttdXN0blteQS1aYS16MC05X10r"}, "replace_global": {"b": true}}}, {"name": "StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_20", "op": "StaticRegexReplace", "input": ["StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_19"], "attr": {"pattern": {"s": "W15BLVphLXowLTlfXSttb3JlW15BLVphLXowLTlfXSs="}, "replace_global": {"b": true}, "rewrite": {"s": "IA=="}}}, {"name": "StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_21", "op": "StaticRegexReplace", "input": ["StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_20"], "attr": {"pattern": {"s": "W15BLVphLXowLTlfXStpZlteQS1aYS16MC05X10r"}, "rewrite": {"s": "IA=="}, "replace_global": {"b": true}}}, {"name": "StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_22", "op": "StaticRegexReplace", "input": ["StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_21"], "attr": {"pattern": {"s": "W15BLVphLXowLTlfXSthdFteQS1aYS16MC05X10r"}, "replace_global": {"b": true}, "rewrite": {"s": "IA=="}}}, {"name": "StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_23", "op": "StaticRegexReplace", "input": ["StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_22"], "attr": {"pattern": {"s": "W15BLVphLXowLTlfXSt3b3VsZG4ndFteQS1aYS16MC05X10r"}, "replace_global": {"b": true}, "rewrite": {"s": "IA=="}}}, {"name": "StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_24", "op": "StaticRegexReplace", "input": ["StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_23"], "attr": {"rewrite": {"s": "IA=="}, "replace_global": {"b": true}, "pattern": {"s": "W15BLVphLXowLTlfXStjb3VsZG5bXkEtWmEtejAtOV9dKw=="}}}, {"name": "StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_25", "op": "StaticRegexReplace", "input": ["StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_24"], "attr": {"rewrite": {"s": "IA=="}, "replace_global": {"b": true}, "pattern": {"s": "W15BLVphLXowLTlfXStmdXJ0aGVyW15BLVphLXowLTlfXSs="}}}, {"name": "StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_26", "op": "StaticRegexReplace", "input": ["StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_25"], "attr": {"pattern": {"s": "W15BLVphLXowLTlfXStvZlteQS1aYS16MC05X10r"}, "rewrite": {"s": "IA=="}, "replace_global": {"b": true}}}, {"name": "StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_27", "op": "StaticRegexReplace", "input": ["StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_26"], "attr": {"rewrite": {"s": "IA=="}, "replace_global": {"b": true}, "pattern": {"s": "W15BLVphLXowLTlfXSt0W15BLVphLXowLTlfXSs="}}}, {"name": "StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_28", "op": "StaticRegexReplace", "input": ["StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_27"], "attr": {"replace_global": {"b": true}, "rewrite": {"s": "IA=="}, "pattern": {"s": "W15BLVphLXowLTlfXStvclteQS1aYS16MC05X10r"}}}, {"name": "StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_29", "op": "StaticRegexReplace", "input": ["StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_28"], "attr": {"pattern": {"s": "W15BLVphLXowLTlfXStoYWRuJ3RbXkEtWmEtejAtOV9dKw=="}, "replace_global": {"b": true}, "rewrite": {"s": "IA=="}}}, {"name": "StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_30", "op": "StaticRegexReplace", "input": ["StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_29"], "attr": {"rewrite": {"s": "IA=="}, "replace_global": {"b": true}, "pattern": {"s": "W15BLVphLXowLTlfXStzaG91bGRuW15BLVphLXowLTlfXSs="}}}, {"name": "StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_31", "op": "StaticRegexReplace", "input": ["StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_30"], "attr": {"replace_global": {"b": true}, "rewrite": {"s": "IA=="}, "pattern": {"s": "W15BLVphLXowLTlfXStub3JbXkEtWmEtejAtOV9dKw=="}}}, {"name": "StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_32", "op": "StaticRegexReplace", "input": ["StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_31"], "attr": {"pattern": {"s": "W15BLVphLXowLTlfXStiZWVuW15BLVphLXowLTlfXSs="}, "rewrite": {"s": "IA=="}, "replace_global": {"b": true}}}, {"name": "StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_33", "op": "StaticRegexReplace", "input": ["StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_32"], "attr": {"rewrite": {"s": "IA=="}, "pattern": {"s": "W15BLVphLXowLTlfXStzb1teQS1aYS16MC05X10r"}, "replace_global": {"b": true}}}, {"name": "StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_34", "op": "StaticRegexReplace", "input": ["StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_33"], "attr": {"rewrite": {"s": "IA=="}, "replace_global": {"b": true}, "pattern": {"s": "W15BLVphLXowLTlfXStoYXZlW15BLVphLXowLTlfXSs="}}}, {"name": "StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_35", "op": "StaticRegexReplace", "input": ["StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_34"], "attr": {"pattern": {"s": "W15BLVphLXowLTlfXStpdHNbXkEtWmEtejAtOV9dKw=="}, "replace_global": {"b": true}, "rewrite": {"s": "IA=="}}}, {"name": "StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_36", "op": "StaticRegexReplace", "input": ["StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_35"], "attr": {"pattern": {"s": "W15BLVphLXowLTlfXStoYXNuW15BLVphLXowLTlfXSs="}, "replace_global": {"b": true}, "rewrite": {"s": "IA=="}}}, {"name": "StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_37", "op": "StaticRegexReplace", "input": ["StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_36"], "attr": {"replace_global": {"b": true}, "pattern": {"s": "W15BLVphLXowLTlfXStzYXZlW15BLVphLXowLTlfXSs="}, "rewrite": {"s": "IA=="}}}, {"name": "StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_38", "op": "StaticRegexReplace", "input": ["StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_37"], "attr": {"rewrite": {"s": "IA=="}, "replace_global": {"b": true}, "pattern": {"s": "W15BLVphLXowLTlfXSt2ZVteQS1aYS16MC05X10r"}}}, {"name": "StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_39", "op": "StaticRegexReplace", "input": ["StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_38"], "attr": {"pattern": {"s": "W15BLVphLXowLTlfXStvdXJzW15BLVphLXowLTlfXSs="}, "replace_global": {"b": true}, "rewrite": {"s": "IA=="}}}, {"name": "StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_40", "op": "StaticRegexReplace", "input": ["StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_39"], "attr": {"pattern": {"s": "W15BLVphLXowLTlfXStoaXNbXkEtWmEtejAtOV9dKw=="}, "rewrite": {"s": "IA=="}, "replace_global": {"b": true}}}, {"name": "StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_41", "op": "StaticRegexReplace", "input": ["StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_40"], "attr": {"pattern": {"s": "W15BLVphLXowLTlfXStvdXRbXkEtWmEtejAtOV9dKw=="}, "rewrite": {"s": "IA=="}, "replace_global": {"b": true}}}, {"name": "StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_42", "op": "StaticRegexReplace", "input": ["StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_41"], "attr": {"rewrite": {"s": "IA=="}, "replace_global": {"b": true}, "pattern": {"s": "W15BLVphLXowLTlfXStvdXJzZWx2ZXNbXkEtWmEtejAtOV9dKw=="}}}, {"name": "StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_43", "op": "StaticRegexReplace", "input": ["StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_42"], "attr": {"rewrite": {"s": "IA=="}, "replace_global": {"b": true}, "pattern": {"s": "W15BLVphLXowLTlfXSt3YXNuW15BLVphLXowLTlfXSs="}}}, {"name": "StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_44", "op": "StaticRegexReplace", "input": ["StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_43"], "attr": {"pattern": {"s": "W15BLVphLXowLTlfXStteVteQS1aYS16MC05X10r"}, "replace_global": {"b": true}, "rewrite": {"s": "IA=="}}}, {"name": "StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_45", "op": "StaticRegexReplace", "input": ["StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_44"], "attr": {"replace_global": {"b": true}, "rewrite": {"s": "IA=="}, "pattern": {"s": "W15BLVphLXowLTlfXStmaW5hbGx5W15BLVphLXowLTlfXSs="}}}, {"name": "StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_46", "op": "StaticRegexReplace", "input": ["StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_45"], "attr": {"replace_global": {"b": true}, "pattern": {"s": "W15BLVphLXowLTlfXStkb2VzW15BLVphLXowLTlfXSs="}, "rewrite": {"s": "IA=="}}}, {"name": "StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_47", "op": "StaticRegexReplace", "input": ["StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_46"], "attr": {"pattern": {"s": "W15BLVphLXowLTlfXStyZVteQS1aYS16MC05X10r"}, "rewrite": {"s": "IA=="}, "replace_global": {"b": true}}}, {"name": "StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_48", "op": "StaticRegexReplace", "input": ["StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_47"], "attr": {"replace_global": {"b": true}, "pattern": {"s": "W15BLVphLXowLTlfXStleGNsdWRpbmdbXkEtWmEtejAtOV9dKw=="}, "rewrite": {"s": "IA=="}}}, {"name": "StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_49", "op": "StaticRegexReplace", "input": ["StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_48"], "attr": {"replace_global": {"b": true}, "rewrite": {"s": "IA=="}, "pattern": {"s": "W15BLVphLXowLTlfXSttaWdodG4ndFteQS1aYS16MC05X10r"}}}, {"name": "StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_50", "op": "StaticRegexReplace", "input": ["StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_49"], "attr": {"pattern": {"s": "W15BLVphLXowLTlfXStmcm9tW15BLVphLXowLTlfXSs="}, "replace_global": {"b": true}, "rewrite": {"s": "IA=="}}}, {"name": "StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_51", "op": "StaticRegexReplace", "input": ["StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_50"], "attr": {"pattern": {"s": "W15BLVphLXowLTlfXSthcm91bmRbXkEtWmEtejAtOV9dKw=="}, "rewrite": {"s": "IA=="}, "replace_global": {"b": true}}}, {"name": "StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_52", "op": "StaticRegexReplace", "input": ["StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_51"], "attr": {"replace_global": {"b": true}, "rewrite": {"s": "IA=="}, "pattern": {"s": "W15BLVphLXowLTlfXSt0aGVyZVteQS1aYS16MC05X10r"}}}, {"name": "StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_53", "op": "StaticRegexReplace", "input": ["StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_52"], "attr": {"replace_global": {"b": true}, "rewrite": {"s": "IA=="}, "pattern": {"s": "W15BLVphLXowLTlfXStjYW5bXkEtWmEtejAtOV9dKw=="}}}, {"name": "StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_54", "op": "StaticRegexReplace", "input": ["StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_53"], "attr": {"rewrite": {"s": "IA=="}, "pattern": {"s": "W15BLVphLXowLTlfXSt3aGVyZVteQS1aYS16MC05X10r"}, "replace_global": {"b": true}}}, {"name": "StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_55", "op": "StaticRegexReplace", "input": ["StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_54"], "attr": {"rewrite": {"s": "IA=="}, "replace_global": {"b": true}, "pattern": {"s": "W15BLVphLXowLTlfXSt0aGVzZVteQS1aYS16MC05X10r"}}}, {"name": "StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_56", "op": "StaticRegexReplace", "input": ["StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_55"], "attr": {"rewrite": {"s": "IA=="}, "replace_global": {"b": true}, "pattern": {"s": "W15BLVphLXowLTlfXSt1bmRlclteQS1aYS16MC05X10r"}}}, {"name": "StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_57", "op": "StaticRegexReplace", "input": ["StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_56"], "attr": {"pattern": {"s": "W15BLVphLXowLTlfXStiZXNpZGVzW15BLVphLXowLTlfXSs="}, "replace_global": {"b": true}, "rewrite": {"s": "IA=="}}}, {"name": "StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_58", "op": "StaticRegexReplace", "input": ["StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_57"], "attr": {"rewrite": {"s": "IA=="}, "replace_global": {"b": true}, "pattern": {"s": "W15BLVphLXowLTlfXSthbW9uZ1teQS1aYS16MC05X10r"}}}, {"name": "StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_59", "op": "StaticRegexReplace", "input": ["StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_58"], "attr": {"pattern": {"s": "W15BLVphLXowLTlfXSt5b3VyW15BLVphLXowLTlfXSs="}, "replace_global": {"b": true}, "rewrite": {"s": "IA=="}}}, {"name": "StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_60", "op": "StaticRegexReplace", "input": ["StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_59"], "attr": {"pattern": {"s": "W15BLVphLXowLTlfXSthW15BLVphLXowLTlfXSs="}, "replace_global": {"b": true}, "rewrite": {"s": "IA=="}}}, {"name": "StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_61", "op": "StaticRegexReplace", "input": ["StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_60"], "attr": {"rewrite": {"s": "IA=="}, "pattern": {"s": "W15BLVphLXowLTlfXStiZWluZ1teQS1aYS16MC05X10r"}, "replace_global": {"b": true}}}, {"name": "StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_62", "op": "StaticRegexReplace", "input": ["StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_61"], "attr": {"pattern": {"s": "W15BLVphLXowLTlfXStkaWRuW15BLVphLXowLTlfXSs="}, "rewrite": {"s": "IA=="}, "replace_global": {"b": true}}}, {"name": "StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_63", "op": "StaticRegexReplace", "input": ["StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_62"], "attr": {"rewrite": {"s": "IA=="}, "replace_global": {"b": true}, "pattern": {"s": "W15BLVphLXowLTlfXStkb2Vzbid0W15BLVphLXowLTlfXSs="}}}, {"name": "StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_64", "op": "StaticRegexReplace", "input": ["StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_63"], "attr": {"pattern": {"s": "W15BLVphLXowLTlfXSt0b3dhcmRbXkEtWmEtejAtOV9dKw=="}, "rewrite": {"s": "IA=="}, "replace_global": {"b": true}}}, {"name": "StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_65", "op": "StaticRegexReplace", "input": ["StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_64"], "attr": {"replace_global": {"b": true}, "rewrite": {"s": "IA=="}, "pattern": {"s": "W15BLVphLXowLTlfXSthbG1vc3RbXkEtWmEtejAtOV9dKw=="}}}, {"name": "StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_66", "op": "StaticRegexReplace", "input": ["StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_65"], "attr": {"replace_global": {"b": true}, "pattern": {"s": "W15BLVphLXowLTlfXSthbWlkW15BLVphLXowLTlfXSs="}, "rewrite": {"s": "IA=="}}}, {"name": "StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_67", "op": "StaticRegexReplace", "input": ["StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_66"], "attr": {"rewrite": {"s": "IA=="}, "pattern": {"s": "W15BLVphLXowLTlfXStoYXZpbmdbXkEtWmEtejAtOV9dKw=="}, "replace_global": {"b": true}}}, {"name": "StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_68", "op": "StaticRegexReplace", "input": ["StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_67"], "attr": {"replace_global": {"b": true}, "rewrite": {"s": "IA=="}, "pattern": {"s": "W15BLVphLXowLTlfXStjb25zaWRlcmluZ1teQS1aYS16MC05X10r"}}}, {"name": "StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_69", "op": "StaticRegexReplace", "input": ["StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_68"], "attr": {"replace_global": {"b": true}, "rewrite": {"s": "IA=="}, "pattern": {"s": "W15BLVphLXowLTlfXStwbHVzW15BLVphLXowLTlfXSs="}}}, {"name": "StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_70", "op": "StaticRegexReplace", "input": ["StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_69"], "attr": {"pattern": {"s": "W15BLVphLXowLTlfXStvbnRvW15BLVphLXowLTlfXSs="}, "replace_global": {"b": true}, "rewrite": {"s": "IA=="}}}, {"name": "StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_71", "op": "StaticRegexReplace", "input": ["StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_70"], "attr": {"replace_global": {"b": true}, "pattern": {"s": "W15BLVphLXowLTlfXStiZWZvcmVbXkEtWmEtejAtOV9dKw=="}, "rewrite": {"s": "IA=="}}}, {"name": "StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_72", "op": "StaticRegexReplace", "input": ["StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_71"], "attr": {"pattern": {"s": "W15BLVphLXowLTlfXStkb1teQS1aYS16MC05X10r"}, "rewrite": {"s": "IA=="}, "replace_global": {"b": true}}}, {"name": "StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_73", "op": "StaticRegexReplace", "input": ["StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_72"], "attr": {"rewrite": {"s": "IA=="}, "replace_global": {"b": true}, "pattern": {"s": "W15BLVphLXowLTlfXStzaGUnc1teQS1aYS16MC05X10r"}}}, {"name": "StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_74", "op": "StaticRegexReplace", "input": ["StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_73"], "attr": {"replace_global": {"b": true}, "rewrite": {"s": "IA=="}, "pattern": {"s": "W15BLVphLXowLTlfXStkb2VzblteQS1aYS16MC05X10r"}}}, {"name": "StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_75", "op": "StaticRegexReplace", "input": ["StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_74"], "attr": {"pattern": {"s": "W15BLVphLXowLTlfXSttdXN0bid0W15BLVphLXowLTlfXSs="}, "rewrite": {"s": "IA=="}, "replace_global": {"b": true}}}, {"name": "StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_76", "op": "StaticRegexReplace", "input": ["StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_75"], "attr": {"rewrite": {"s": "IA=="}, "replace_global": {"b": true}, "pattern": {"s": "W15BLVphLXowLTlfXSttZVteQS1aYS16MC05X10r"}}}, {"name": "StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_77", "op": "StaticRegexReplace", "input": ["StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_76"], "attr": {"rewrite": {"s": "IA=="}, "replace_global": {"b": true}, "pattern": {"s": "W15BLVphLXowLTlfXStiZW5lYXRoW15BLVphLXowLTlfXSs="}}}, {"name": "StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_78", "op": "StaticRegexReplace", "input": ["StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_77"], "attr": {"rewrite": {"s": "IA=="}, "replace_global": {"b": true}, "pattern": {"s": "W15BLVphLXowLTlfXStpdHNlbGZbXkEtWmEtejAtOV9dKw=="}}}, {"name": "StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_79", "op": "StaticRegexReplace", "input": ["StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_78"], "attr": {"rewrite": {"s": "IA=="}, "replace_global": {"b": true}, "pattern": {"s": "W15BLVphLXowLTlfXStteXNlbGZbXkEtWmEtejAtOV9dKw=="}}}, {"name": "StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_80", "op": "StaticRegexReplace", "input": ["StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_79"], "attr": {"replace_global": {"b": true}, "pattern": {"s": "W15BLVphLXowLTlfXStpbnRvW15BLVphLXowLTlfXSs="}, "rewrite": {"s": "IA=="}}}, {"name": "StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_81", "op": "StaticRegexReplace", "input": ["StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_80"], "attr": {"replace_global": {"b": true}, "rewrite": {"s": "IA=="}, "pattern": {"s": "W15BLVphLXowLTlfXStzb21lW15BLVphLXowLTlfXSs="}}}, {"name": "StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_82", "op": "StaticRegexReplace", "input": ["StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_81"], "attr": {"replace_global": {"b": true}, "rewrite": {"s": "IA=="}, "pattern": {"s": "W15BLVphLXowLTlfXStiZWhpbmRbXkEtWmEtejAtOV9dKw=="}}}, {"name": "StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_83", "op": "StaticRegexReplace", "input": ["StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_82"], "attr": {"pattern": {"s": "W15BLVphLXowLTlfXSt3b3VsZG5bXkEtWmEtejAtOV9dKw=="}, "replace_global": {"b": true}, "rewrite": {"s": "IA=="}}}, {"name": "StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_84", "op": "StaticRegexReplace", "input": ["StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_83"], "attr": {"replace_global": {"b": true}, "pattern": {"s": "W15BLVphLXowLTlfXSthcmVuJ3RbXkEtWmEtejAtOV9dKw=="}, "rewrite": {"s": "IA=="}}}, {"name": "StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_85", "op": "StaticRegexReplace", "input": ["StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_84"], "attr": {"replace_global": {"b": true}, "rewrite": {"s": "IA=="}, "pattern": {"s": "W15BLVphLXowLTlfXStvd25bXkEtWmEtejAtOV9dKw=="}}}, {"name": "StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_86", "op": "StaticRegexReplace", "input": ["StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_85"], "attr": {"rewrite": {"s": "IA=="}, "replace_global": {"b": true}, "pattern": {"s": "W15BLVphLXowLTlfXStvZnRlblteQS1aYS16MC05X10r"}}}, {"name": "StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_87", "op": "StaticRegexReplace", "input": ["StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_86"], "attr": {"pattern": {"s": "W15BLVphLXowLTlfXSt5b3Vyc2VsZlteQS1aYS16MC05X10r"}, "rewrite": {"s": "IA=="}, "replace_global": {"b": true}}}, {"name": "StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_88", "op": "StaticRegexReplace", "input": ["StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_87"], "attr": {"pattern": {"s": "W15BLVphLXowLTlfXStzb29uW15BLVphLXowLTlfXSs="}, "replace_global": {"b": true}, "rewrite": {"s": "IA=="}}}, {"name": "StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_89", "op": "StaticRegexReplace", "input": ["StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_88"], "attr": {"pattern": {"s": "W15BLVphLXowLTlfXSt3b25bXkEtWmEtejAtOV9dKw=="}, "rewrite": {"s": "IA=="}, "replace_global": {"b": true}}}, {"name": "StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_90", "op": "StaticRegexReplace", "input": ["StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_89"], "attr": {"pattern": {"s": "W15BLVphLXowLTlfXSt0aGlzW15BLVphLXowLTlfXSs="}, "replace_global": {"b": true}, "rewrite": {"s": "IA=="}}}, {"name": "StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_91", "op": "StaticRegexReplace", "input": ["StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_90"], "attr": {"replace_global": {"b": true}, "rewrite": {"s": "IA=="}, "pattern": {"s": "W15BLVphLXowLTlfXStmb3JbXkEtWmEtejAtOV9dKw=="}}}, {"name": "StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_92", "op": "StaticRegexReplace", "input": ["StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_91"], "attr": {"replace_global": {"b": true}, "rewrite": {"s": "IA=="}, "pattern": {"s": "W15BLVphLXowLTlfXSt5W15BLVphLXowLTlfXSs="}}}, {"name": "StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_93", "op": "StaticRegexReplace", "input": ["StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_92"], "attr": {"rewrite": {"s": "IA=="}, "pattern": {"s": "W15BLVphLXowLTlfXSthbmRbXkEtWmEtejAtOV9dKw=="}, "replace_global": {"b": true}}}, {"name": "StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_94", "op": "StaticRegexReplace", "input": ["StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_93"], "attr": {"pattern": {"s": "W15BLVphLXowLTlfXSthZnRlclteQS1aYS16MC05X10r"}, "replace_global": {"b": true}, "rewrite": {"s": "IA=="}}}, {"name": "StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_95", "op": "StaticRegexReplace", "input": ["StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_94"], "attr": {"rewrite": {"s": "IA=="}, "replace_global": {"b": true}, "pattern": {"s": "W15BLVphLXowLTlfXStldmVuW15BLVphLXowLTlfXSs="}}}, {"name": "StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_96", "op": "StaticRegexReplace", "input": ["StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_95"], "attr": {"rewrite": {"s": "IA=="}, "replace_global": {"b": true}, "pattern": {"s": "W15BLVphLXowLTlfXStleGNlcHRpbmdbXkEtWmEtejAtOV9dKw=="}}}, {"name": "StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_97", "op": "StaticRegexReplace", "input": ["StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_96"], "attr": {"rewrite": {"s": "IA=="}, "replace_global": {"b": true}, "pattern": {"s": "W15BLVphLXowLTlfXStlYXJseVteQS1aYS16MC05X10r"}}}, {"name": "StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_98", "op": "StaticRegexReplace", "input": ["StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_97"], "attr": {"rewrite": {"s": "IA=="}, "replace_global": {"b": true}, "pattern": {"s": "W15BLVphLXowLTlfXSt3aG9bXkEtWmEtejAtOV9dKw=="}}}, {"name": "StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_99", "op": "StaticRegexReplace", "input": ["StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_98"], "attr": {"pattern": {"s": "W15BLVphLXowLTlfXStoaW1bXkEtWmEtejAtOV9dKw=="}, "rewrite": {"s": "IA=="}, "replace_global": {"b": true}}}, {"name": "StatefulPartitionedCall/CNN_hotel_review/text_vectorization_5/StaticRegexReplace_100", "op": "StaticRegexReplace", "input": 